* read_clocking

This function parses all `*.org` files in a given directory. It extracts all clocking information and associates it with its parent header (Feature) and sub-header (Task).

The function returns a pandas DataFrame. Which contains

| Field    | Type   | Description                               |
|----------+--------+-------------------------------------------|
| start    | string | Date in format [year]-[month]-[day]       |
| duration | double | Time spend in this task. The unit is hour |
| head1    | string | Heading level 1 before clockin entry      |
| head2    | string | Heading level 2 before clockin entry      |

** Example usage

Let's say you have an org file ~tasks.org~ in a directory called ~my_orgs~ with the following content:

#+begin_src text
* Feature A
** Task 1
CLOCK: [2025-10-25 Sat 10:00]--[2025-10-25 Sat 11:30] =>  1:30
** Task 2
CLOCK: [2025-10-25 Sat 12:00]--[2025-10-25 Sat 13:00] =>  1:00

* Feature B
** Task 3
CLOCK: [2025-10-25 Sat 14:00]--[2025-10-25 Sat 14:30] =>  0:30
#+end_src


You can parse this file and analyze the data with pandas like this:

#+begin_src python
from org_analyze.clocks import read_clockins

# 1. Parse the org files in the directory
df = read_clockins('my_orgs')

# 2. Analyze the data: Group by feature (head1) and sum the duration
feature_hours = df.groupby('head1')['duration'].sum()

print("Total hours per feature:")
print(feature_hours)
#+end_src

Output:

#+begin_src
Total hours per feature:
head1
Feature A    2.5
Feature B    0.5
Name: duration, dtype: float64
#+end_src


